""" Отримання документів з колекції за допомогою методу find_one() та ObjectId."""
# Імпортуємо клас ObjectId з бібліотеки bson, який дозволяє працювати з унікальними
# ідентифікаторами документів у MongoDB. Також імпортуємо MongoClient та ServerApi для підключення
# до бази даних. Підключаємося до бази даних, створюємо об'єкт db для роботи з базою даних book.
# Використовуємо метод find_one() для отримання одного документа з колекції cats за його унікальним
# ідентифікатором (ObjectId). Результат виводимо на екран.
from bson.objectid import ObjectId
from pymongo import MongoClient
from pymongo.server_api import ServerApi

client = MongoClient(
    "mongodb+srv://kalinasergey911_db_user:OWW12HRdqXJtX2uK@cluster0.a23fjxm.mongodb.net/book?appName=Cluster0",
    server_api=ServerApi('1')
)
# Створюємо базу даних book та колекцію cats
db = client.book

# Метод find_one() приймає словник з умовою пошуку. У цьому випадку ми шукаємо документ, у якому
# поле "_id" дорівнює ObjectId("69f6226e3cb394611bb32990"). ObjectId - це унікальний ідентифікатор,
# який автоматично генерується MongoDB для кожного документа. Щоб знайти документ за його ObjectId,
# ми використовуємо клас ObjectId з бібліотеки bson і передаємо йому рядок з ідентифікатором.
# Результат буде словником, який містить дані документа, або None, якщо документ не знайдено.
# У цьому випадку ми виводимо результат на екран.
result = db.cats.find_one({"_id": ObjectId("69f6226e3cb394611bb32990")})
print("Found result:", result)

# Метод find() дозволяє отримати всі документи з колекції, які відповідають певній умові. Якщо
# умова не вказана, то метод повертає всі документи з колекції. Результат буде ітерованим об'єктом,
# який містить словники з даними кожного документа. Ми можемо перебрати цей об'єкт у циклі і
# вивести кожен документ на екран. У цьому випадку ми використовуємо метод find() без умов, щоб
# отримати всі документи з колекції cats, і виводимо їх на екран.
result = db.cats.find({})
for el in result:
    print("Found document:", el)

# Метод update_one() дозволяє оновити один документ, який відповідає певній умові. Він приймає два
# аргументи: словник з умовою пошуку та словник з операцією оновлення. У цьому випадку ми шукаємо
# документ, у якому поле "name" дорівнює "barsik", і оновлюємо його, встановивши нове значення для
# поля "age" за допомогою оператора $set. Після оновлення ми використовуємо метод find_one() для
# отримання оновленого документа і виводимо його на екран. Результат буде словником з даними
# оновленого документа, який містить нове значення для поля "age".
db.cats.update_one({"name": "barsik"}, {"$set": {"age": 4}})
result = db.cats.find_one({"name": "barsik"})
print("Updated result:", result)

# Метод delete_one() дозволяє видалити один документ, який відповідає певній умові. Він приймає
# словник з умовою пошуку. У цьому випадку ми шукаємо документ, у якому поле "name" дорівнює
# "barsik", і видаляємо його з колекції. Після видалення ми використовуємо метод find_one() для
# отримання документа з тією ж умовою, щоб переконатися, що він був видалений. Результат буде None,
# оскільки документ з ім'ям "barsik" більше не існує в колекції. Ми виводимо результат на екран,
# щоб підтвердити, що документ був успішно видалений. 
db.cats.delete_one({"name": "barsik"})
result = db.cats.find_one({"name": "barsik"})
print("Deleted result:", result)