""" У цьому файлі ми встановлюємо з'єднання з базою даних MongoDB за допомогою бібліотеки
MongoEngine. Ми використовуємо функцію connect для підключення до бази даних, передаючи їй рядок
підключення, який містить інформацію про користувача, пароль, домен і назву бази даних. Ця
інформація зберігається в конфігураційному файлі config.ini, який ми читаємо за допомогою модуля
configparser. Після виконання цього коду ми будемо мати встановлене з'єднання з базою даних, і ми
зможемо виконувати операції з нею, такі як створення, читання,оновлення та видалення документів."""

# Імпортуємо функцію connect з бібліотеки mongoengine, яка використовується для встановлення
# з'єднання з базою даних MongoDB. Ця функція приймає ряд параметрів, таких як host, port,
# username, password та інші, які необхідні для підключення до бази даних. У нашому випадку ми
# будемо використовувати рядок підключення, який містить всю необхідну інформацію для підключення
# до бази даних.
from mongoengine import connect
# Імпортуємо модуль configparser, який дозволяє нам читати конфігураційні файли у форматі INI. Ми
# будемо використовувати цей модуль для зчитування параметрів підключення до бази даних з файлу
# config.ini.
import configparser

# Створюємо об'єкт ConfigParser, який буде використовуватися для читання конфігураційного файлу.
config = configparser.ConfigParser()
config.read('config.ini')

# Зчитуємо параметри підключення до бази даних з конфігураційного файлу. Ми отримуємо ім'я
# користувача, пароль, назву бази даних і домен з секції 'DB' у файлі config.ini. Ці параметри
# будуть використовуватися для формування рядка підключення до бази даних.
mongo_user = config.get('DB', 'user')
mongodb_pass = config.get('DB', 'pass')
db_name = config.get('DB', 'db_name')
domain = config.get('DB', 'domain')

# connect to cluster on AtlasDB with connection string

connect(host=f"""mongodb+srv://{mongo_user}:{mongodb_pass}@{domain}/{db_name}?retryWrites=true&w=majority""", ssl=True)
